app/Http/Controllers/Admin/ArticleController.php

            return $result;

        }
        $article = Article::get();
---
select * from `articles` where `articles`.`deleted_at` is null