app/Http/Controllers/Admin/LoginController.php

select * from `nodes` where `nodes`.`deleted_at` is null
---
  public function  login(Request $request){
        if (auth('admin')->check()){
            return redirect(route('admin.index'));
        }

      if ($request->isMethod('post')){

          $data=$this->validate($request, [
              'username' => ["required"],
              'password' => ['required'],
          ]);
//          dd(Auth::guard('web')->attempt($data));
          $bool=auth('admin')->attempt($data);

          if ($bool){
                //判断是否是超级管理员
              if (auth('admin')->user()->username ===config('rbac.super')) {

                  $auth=getChild(Node::get()->toArray());