app/Http/Controllers/Admin/ManagerController.php

    public function index()
    {
        $data=Manager::paginate(1000);
---
select * from `managers` order by `id` asc limit 1000 offset 0
select count(*) as aggregate from `managers`