app/Http/Controllers/Admin/NodeController.php

select * from `nodes` where `nodes`.`deleted_at` is null limit 1000 offset 0
select count(*) as aggregate from `nodes` where `nodes`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $params = $request->get('node_name', '');

        if ($params != '') {
            $data = Node::when($params, function ($query) use ($params) {

                $query->where('node_name', 'like', "%{$params}%");
            })->paginate($this->pagesize);
        } else {
            $data = getTree(Node::when($params, function ($query) use ($params) {

                $query->where('node_name', 'like', "%{$params}%");
            })->paginate($this->pagesize));