app/Http/Controllers/Admin/RoleController.php

    public function index(Request $request)
    {
        $params = $request->get('role_name', '');


        $data = Role::when($params, function ($query) use ($params) {

            $query->where('role_name', 'like', "%{$params}%");
        })->paginate($this->pagesize);
---
select * from `roles` where `roles`.`deleted_at` is null limit 1000 offset 0
select count(*) as aggregate from `roles` where `roles`.`deleted_at` is null